const libs = `的一是在不了有和人这中大为上个国我以要他时
     来用们生到作地于出就分对成会可主发年动同
     工也能下过子说产    种面而方后多定行学法所
    民得经十三之进着等部度家电力里如水化高
    自二理起小物现实加 量都两体制机当使点
    从业本去把性好应开它合还因由其些然前
    外天政四日那社义事平形相全表间样与关
    各重新线内数正心反你 明看原又么利比或
    但质气第向道命此变条只没结解问意建月
    公无系军很情者最立代想已通并提直题党
    程展五果料象员革位入常文总次品式活设
    及管特件长求老头基 资边流路级少图山统
    接知较将组见计别她手角期根论运农指几
    九区强放决西被干做必战先回则任取据处
    队南给色光门即保治北造百规热领七海口
    东导器压志世金增争济阶油思术极交受联
    什认六共权收证改清己美再采转更单风切
    打白教速花带安场身车例真务具万每目至
    达走积示议声报斗完类八离华名确才科张
    信马节话米整空元况今集温传土许步群广
    石记需段研界拉林律叫且究观越织装`

function getStr(num) {
    let str = '';
    while (str.length < num) {
        let index = Math.floor(Math.random() * libs.length)
        str += libs.charAt(index)
    }
    return str;
}
export default getStr;